In [30]:
import pandas as pd

In [31]:
movies = pd.read_csv('../data/reduced/movies_m10_rich_pre.csv', index_col='movieId')
ratings = pd.read_csv('../data/reduced/ratings_m10.csv')

In [32]:
ratings.head(1)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703

In [33]:
movies.head(1)

,tmdbId,imdbId,cast,director,keywords,overview,title,genres,year
movieId,,,,,,,,,
117529,135397,369610,"['Chris Pratt', 'Bryce Dallas Howard', 'Irrfan...",Colin Trevorrow,"['monster', 'dna', 'tyrannosaurus rex', 'veloc...",Twenty-two years after the events of Jurassic ...,Jurassic World,"['Action', 'Adventure', 'Drama', 'Sci-Fi', 'Th...",2015

In [34]:
#ratings = ratings.head(200)

In [35]:
def train_test_column_split(df, group_column, split_column, y_label, train_size):
    df = df.sort_values(by=split_column, ascending=True)   
    train = pd.DataFrame(columns=df.columns)
    test = pd.DataFrame(columns=df.columns)

    for idx in df[group_column].unique():
        group = df.loc[df[group_column] == idx]

        q_user = group[group[split_column].le(group[split_column].quantile(train_size))]
        p_user = group[group[split_column].ge(group[split_column].quantile(train_size))]

        train = pd.concat([train, q_user])
        test = pd.concat([test, p_user])
    train = train.sort_index(ascending=True)
    test = test.sort_index(ascending=True)

    X_labels = [c for c in df.columns if c != y_label]

    X_train = train[X_labels]
    X_test = test[X_labels]
    y_train = train[y_label]
    y_test = test[y_label]

    return (X_train, X_test, y_train, y_test)

In [36]:
X_train, X_test, y_train, y_test = train_test_column_split(ratings, 'userId', 'timestamp', 'rating', 0.8)

In [37]:
X_train

      userId movieId   timestamp
0          1       1   964982703
1          1       3   964981247
2          1       6   964982224
4          1      50   964982931
5          1      70   964982400
...      ...     ...         ...
81108    610  152081  1493846503
81109    610  157296  1493846563
81110    610  158238  1479545219
81112    610  164179  1493845631
81115    610  168252  1493846352

[65030 rows x 3 columns]

In [38]:
y_train

0        4.0
1        4.0
2        4.0
4        5.0
5        3.0
        ...
81108    4.0
81109    4.0
81110    5.0
81112    5.0
81115    5.0
Name: rating, Length: 65030, dtype: float64

In [39]:
X_test

      userId movieId   timestamp
3          1      47   964983815
8          1     151   964984041
9          1     157   964984100
10         1     163   964983650
28         1     527   964984002
...      ...     ...         ...
81097    610  135536  1493847638
81105    610  142488  1493849575
81111    610  159093  1493847704
81113    610  166528  1493879365
81114    610  168250  1494273047

[16727 rows x 3 columns]

In [40]:
y_test

3        5.0
8        5.0
9        5.0
10       5.0
28       5.0
        ...
81097    2.5
81105    3.5
81111    3.0
81113    4.0
81114    5.0
Name: rating, Length: 16727, dtype: float64